{
  "data": [
    {
      "name": "Lolmetrics",
      "image": "https://cdn1.epicgames.com/offer/24b9b5e323bc40eea252a10cdd3b2f10/EGS_LeagueofLegends_RiotGames_S1_2560x1440-872a966297484acd0efe49f34edd5aed",
      "url": "Lolmetrics",
      "Address": "https://www.lolmetric.com/",
      "description": "Lolmetrics is a website that provides polling and quizzing features about League of Legends content. It's a counterpart to the well-established analytics websites like Op.gg and U.gg that only look at gameplay statistics. By using Lolmetrics, users can create a community where they share common interests and diverging sentiments about anything League of Legends related. Lolmetrics provides fast CRUD operations such as creating, updating, and deleting polls and quizzes utilizing a serverless Firebase backend. The frontend is Vue3 with many UI/UX packages.",
      "time": "1y",
      "status": "in development",
      "completed": false,
      "tags": ["polling", "quizzing", "league of legends"]
    },
    {
      "name": "Frontend-Recipe",
      "image": "https://www.savoryexperiments.com/wp-content/uploads/2022/10/Marry-Me-Chicken-17.jpg",
      "Address": "https://dev.dpo1dk26fq0tl.amplifyapp.com/",
      "url": "RecipeFinder",
      "description": "Recipe Finder is a webapp that showcases recipes that you look up. It uses the Edamam API to make simple queries to fetch recipe information. It includes all of the nutritional data per recipe and the instructions required to make each dish. This project was developed for my Software Engineering course at GSU where my group and I implemented an agile methodology in the software development cycle.",
      "time": "4m",
      "completed": true,
      "status": "completed",
      "tags": ["Search", "Food", "Health", "Fitness"]
    },
    {
      "name": "Playable Browser Demo",
      "image": "https://github.com/Jrres/portfolio_data/blob/main/294fb14b0d802a2bbf49699cfc6212a4.png?raw=true",
      "Address": "https://jrres.github.io/Game/",
      "url": "Demo",
      "description": "This playable demo I made in a few weeks uses the javascript canvas to render images, text, and code with the request animation frame library. It has a simple leveling system, conditional checks with objects in the game, and a simple combat system with damage events, etc.",
      "time": "2w",
      "completed": true,
      "status": "completed",
      "tags": ["Game Dev", "Game Design", "pixels", "javascript canvas"]
    },
    {
      "name": "My Unity Game",
      "image": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Unity_2021.svg",
      "Address": "https://jrres.github.io/Game/",
      "url": "video",
      "description": "In the process of developing a 3D game using Unity, I dedicated a month to the project. This involved manipulating asset models through character controllers, C# scripts, and navigation meshes. I meticulously crafted scripts for various components, each responsible for distinct functionalities such as movement, collision detection, animation states, and combat mechanics. Furthermore, I implemented an interactive user interface (UI) that facilitates game initiation, character customization, and interaction with non-playable characters (NPCs). The NPC system, integrated with Unity's AI library, utilized navigation meshes to guide NPCs along random points within the game map. These NPCs also responded dynamically to attack states initiated by the user. Throughout the development, I expanded my knowledge in areas like lighting, textures, and the incorporation of visual elements such as decals, including effects like blood. The game is not released yet because there are still many things for me to learn about game development.",
      "time": "1m",
      "completed": false,
      "status": "in development",
      "tags": ["Unity Engine","Game Dev", "Game Design", "3d", "animations", "AI", "C#"]
    },
    
  ]
}
